#pragma once

// PWND (4.17.2.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum PWND.eCharacterRole
enum class EeCharacterRole : uint8_t
{
	Assault                        = 0,
	Defender                       = 1,
	Specialist                     = 2,
	Support                        = 3,
	Unknown                        = 4,
	eCharacterRole_MAX             = 5
};


// Enum PWND.eItemRarity
enum class EeItemRarity : uint8_t
{
	NoRarity                       = 0,
	Common                         = 1,
	Uncommon                       = 2,
	Rare                           = 3,
	Epic                           = 4,
	Unknown                        = 5,
	eItemRarity_MAX                = 6
};


// Enum PWND.ePawnActionState
enum class EePawnActionState : uint8_t
{
	Normal                         = 0,
	Carrier                        = 1,
	Pwner                          = 2,
	RemotePwner                    = 3,
	Reviver                        = 4,
	Humiliater                     = 5,
	Interacting                    = 6,
	Pwnable                        = 7,
	Carried                        = 8,
	Pwnee                          = 9,
	RemotePwnee                    = 10,
	Revivee                        = 11,
	Humiliated                     = 12,
	Respawning                     = 13,
	TornOff                        = 14,
	MAX                            = 15,
	ePawnActionState_MAX           = 16
};


// Enum PWND.eEventTrigger
enum class EeEventTrigger : uint8_t
{
	None                           = 0,
	Acquired                       = 1,
	Activated                      = 2,
	Deactivated                    = 3,
	Timer                          = 4,
	Damage                         = 5,
	Damage_Heat                    = 6,
	Kill                           = 7,
	KillAssist                     = 8,
	RocketJump                     = 9,
	RocketJumpWallH                = 10,
	RocketJumpWallV                = 11,
	RocketJumpFloorH               = 12,
	RocketJumpFloorV               = 13,
	RocketJumpDown                 = 14,
	RocketJumpAir                  = 15,
	RocketJumpSuper                = 16,
	SpecialMovement                = 17,
	PhysicsChange                  = 18,
	EnemyTeamDown                  = 19,
	PwnParty                       = 20,
	Overheated                     = 21,
	Overheat_CooledOff             = 22,
	Pickup_Health                  = 23,
	Pickup_GamePlayItem            = 24,
	Revive_Self                    = 25,
	Heal                           = 26,
	Revive_Started                 = 27,
	Revive_Completed               = 28,
	Revive_Denied                  = 29,
	Revive_Denied_Assist           = 30,
	Revive_Cancelled               = 31,
	PWN_Started                    = 32,
	PWN_Started_Stack              = 33,
	PWN_Completed                  = 34,
	PWN_Completed_Stack            = 35,
	PWN_Denied                     = 36,
	PWN_Denied_Assist              = 37,
	PWN_Denied_Stack               = 38,
	PWN_Cancelled                  = 39,
	PWN_Cancelled_Stack            = 40,
	PWN_Instant                    = 41,
	PWN_Instant_Stack              = 42,
	ScorePoints                    = 43,
	Carry_Pickup                   = 44,
	Carry_Drop                     = 45,
	Carry_Denied                   = 46,
	Entered_PwnZone                = 47,
	Exited_PwnZone                 = 48,
	Spawned_Shield                 = 49,
	Spawned_Shield_Encompass       = 50,
	Spawned_Shield_Replaced        = 51,
	Entered_Shield                 = 52,
	Exited_Shield                  = 53,
	Shield_Damaged                 = 54,
	Shield_Protected               = 55,
	Shield_PanelDestroyed          = 56,
	Shield_Destroyed               = 57,
	Shield_Deactivated             = 58,
	Mantle                         = 59,
	MAX                            = 60,
	eEventTrigger_MAX              = 61
};


// Enum PWND.EndGameReason
enum class EndGameReason : uint8_t
{
	None                           = 0,
	Unknown                        = 1,
	ScoreLimit                     = 2,
	TimeLimit                      = 3,
	ImbalancedTeam                 = 4,
	LowTeamCount                   = 5,
	EmptyTeam                      = 6,
	Empty                          = 7,
	PartialConnect                 = 8,
	NoConnect                      = 9,
	CheatEndGame                   = 10,
	EndGameReason_MAX              = 11
};


// Enum PWND.ePawnWeapon
enum class EePawnWeapon : uint8_t
{
	Main                           = 0,
	PrimaryAbility                 = 1,
	SecondaryAbility               = 2,
	AllAbilities                   = 3,
	AllWeapons                     = 4,
	ePawnWeapon_MAX                = 5
};


// Enum PWND.eRJDir
enum class EeRJDir : uint8_t
{
	RJ_Vertical                    = 0,
	RJ_Forward                     = 1,
	RJ_ForwardRight                = 2,
	RJ_Right                       = 3,
	RJ_BackRight                   = 4,
	RJ_Back                        = 5,
	RJ_BackLeft                    = 6,
	RJ_Left                        = 7,
	RJ_ForwardLeft                 = 8,
	RJ_DIR_MAX                     = 9,
	RJ_MAX                         = 10
};


// Enum PWND.eBotDifficulty
enum class EeBotDifficulty : uint8_t
{
	Easy                           = 0,
	Medium                         = 1,
	Hard                           = 2,
	Dynamic                        = 3,
	Random                         = 4,
	RandomEverySpawn               = 5,
	MAX                            = 6,
	eBotDifficulty_MAX             = 7
};


// Enum PWND.eTeamDesc
enum class EeTeamDesc : uint8_t
{
	Self                           = 0,
	Ally                           = 1,
	Neutral                        = 2,
	Enemy                          = 3,
	MAX                            = 4,
	eTeamDesc_MAX                  = 5
};


// Enum PWND.eCaptureState
enum class EeCaptureState : uint8_t
{
	Empty                          = 0,
	Capturing                      = 1,
	Contested                      = 2,
	Breaking                       = 3,
	LockedDown                     = 4,
	Custom                         = 5,
	eCaptureState_MAX              = 6
};


// Enum PWND.RewardId
enum class ERewardId : uint8_t
{
	HighestRating                  = 0,
	HighestPwnScore                = 1,
	HighestDamageDealt             = 2,
	HighestKDR                     = 3,
	HighestSaveScore               = 4,
	LeastDamageTaken               = 5,
	RewardId_MAX                   = 6
};


// Enum PWND.ePwndAnimCondition
enum class EePwndAnimCondition : uint8_t
{
	Idle                           = 0,
	Strafing                       = 1,
	Falling                        = 2,
	MAX                            = 3,
	ePwndAnimCondition_MAX         = 4
};


// Enum PWND.ePwndAttackMontageType
enum class EePwndAttackMontageType : uint8_t
{
	Air                            = 0,
	Ground                         = 1,
	GroundIdle                     = 2,
	ePwndAttackMontageType_MAX     = 3
};


// Enum PWND.eHitReactDir
enum class EeHitReactDir : uint8_t
{
	Forward                        = 0,
	Back                           = 1,
	Left                           = 2,
	Right                          = 3,
	eHitReactDir_MAX               = 4
};


// Enum PWND.eHeatStatus
enum class EeHeatStatus : uint8_t
{
	Normal                         = 0,
	Warning                        = 1,
	Overheated                     = 2,
	OverheatedCooling              = 3,
	MAX                            = 4,
	eHeatStatus_MAX                = 5
};


// Enum PWND.eRocketJumpControlType
enum class EeRocketJumpControlType : uint8_t
{
	ChargeAutoRelease              = 0,
	ChargeBinary                   = 1,
	ChargeLinear                   = 2,
	ChargeLinearExtraVert          = 3,
	ChargeLinearFourWay            = 4,
	AccelBinary                    = 5,
	GroundVerticalAirHorizontal    = 6,
	AccelLinear                    = 7,
	VelocityBinary                 = 8,
	VelocityLinear                 = 9,
	GroundVelocityBinaryAirAccelBinary = 10,
	GroundVelocityBinaryAirAccelLinear = 11,
	GroundVelocityLinearAirAccelBinary = 12,
	GroundVelocityLinearAirAccelLinear = 13,
	AccelLinearDecay               = 14,
	AccelLinearDigitalDecay        = 15,
	DoubleTapVertical              = 16,
	DoubleTapHorizontal            = 17,
	AccelBinaryDoubleTapVertical   = 18,
	MAX                            = 19,
	eRocketJumpControlType_MAX     = 20
};


// Enum PWND.eCustomMovement
enum class EeCustomMovement : uint8_t
{
	CUSTOM_MOVE_None               = 0,
	CUSTOM_MOVE_GrindRail          = 1,
	CUSTOM_MOVE_GrappleHook        = 2,
	CUSTOM_MOVE_GrappleHookExternal = 3,
	CUSTOM_MOVE_RocketJump         = 4,
	CUSTOM_MOVE_Carried            = 5,
	CUSTOM_MOVE_SkyDash            = 6,
	CUSTOM_MOVE_Katamari           = 7,
	CUSTOM_MOVE_Mantle             = 8,
	CUSTOM_MOVE_AirHover           = 9,
	CUSTOM_MOVE_BodyStack          = 10,
	CUSTOM_MOVE_PwnerReviver       = 11,
	CUSTOM_MOVE_WallRun            = 12,
	CUSTOM_MOVE_PassiveWallRun     = 13,
	CUSTOM_MOVE_GroundSlam         = 14,
	CUSTOM_MOVE_MoveToExternal     = 15,
	CUSTOM_MOVE_HoldPositionExternal = 16,
	CUSTOM_MOVE_CharacterPullInAttacker = 17,
	CUSTOM_MOVE_CharacterPullInTarget = 18,
	CUSTOM_MOVE_TankMode_Walking   = 19,
	CUSTOM_MOVE_TankMode_Falling   = 20,
	CUSTOM_MOVE_MAX                = 21
};


// Enum PWND.eDamageElement
enum class EeDamageElement : uint8_t
{
	None                           = 0,
	Physical                       = 1,
	Fire                           = 2,
	Ice                            = 3,
	Electric                       = 4,
	eDamageElement_MAX             = 5
};


// Enum PWND.EEndOfMatchPwningAnimStage
enum class EEndOfMatchPwningAnimStage : uint8_t
{
	ReadyToPlay                    = 0,
	IntroPlaying                   = 1,
	LoopPlaying                    = 2,
	OutroPlaying                   = 3,
	Done                           = 4,
	EEndOfMatchPwningAnimStage_MAX = 5
};


// Enum PWND.EEndOfMatchSequenceStage
enum class EEndOfMatchSequenceStage : uint8_t
{
	Initial                        = 0,
	WinningPwn                     = 1,
	ShowRankings                   = 2,
	ShowLoadouts                   = 3,
	Done                           = 4,
	EEndOfMatchSequenceStage_MAX   = 5
};


// Enum PWND.eFieldTagType
enum class EeFieldTagType : uint8_t
{
	PawnNameplate                  = 0,
	PawnPwnable                    = 1,
	PawnPwning                     = 2,
	PawnReviving                   = 3,
	PawnCarrying                   = 4,
	PawnReviveDenied               = 5,
	PawnPwned                      = 6,
	PawnPwnDenied                  = 7,
	Generic                        = 8,
	PwnBall                        = 9,
	PwnFlag                        = 10,
	HealthPack                     = 11,
	CapturePoint                   = 12,
	CapturePointField              = 13,
	PawnPrePwnstack                = 14,
	PawnPwnstack                   = 15,
	Basic                          = 16,
	Projectile                     = 17,
	Respawn                        = 18,
	NumFieldTagTypes               = 19,
	eFieldTagType_MAX              = 20
};


// Enum PWND.ePwndGameplayEvent
enum class EePwndGameplayEvent : uint8_t
{
	Invalid                        = 0,
	Location                       = 1,
	Damage                         = 2,
	Kill                           = 3,
	PwnStart                       = 4,
	PwnCancel                      = 5,
	PwnComplete                    = 6,
	ReviveStart                    = 7,
	ReviveCancel                   = 8,
	ReviveComplete                 = 9,
	ReviveSelf                     = 10,
	Heal                           = 11,
	RocketJump                     = 12,
	RocketJumpFailed               = 13,
	SpecialMovement                = 14,
	SpecialMovementFailed          = 15,
	MantleAuto                     = 16,
	MantleManual                   = 17,
	FireWeapon                     = 18,
	ProjectileLaunch               = 19,
	ProjectileDetonate             = 20,
	HeadBonk                       = 21,
	SuddenStop                     = 22,
	HiSpeedImpact                  = 23,
	Score                          = 24,
	RankUp                         = 25,
	SpawnShield                    = 26,
	ShutdownShield                 = 27,
	DamageShieldPanel              = 28,
	ShutdownShieldPanel            = 29,
	ePwndGameplayEvent_MAX         = 30
};


// Enum PWND.EInteractionSegmentType
enum class EInteractionSegmentType : uint8_t
{
	Intro                          = 0,
	Outro                          = 1,
	Loop                           = 2,
	Surf                           = 3,
	MAX                            = 4,
	EInteractionSegmentType_MAX    = 5
};


// Enum PWND.ECancelMatchmakingReason
enum class ECancelMatchmakingReason : uint8_t
{
	UserCancelled                  = 0,
	Lost                           = 1,
	PartyMemberIgnoreLost          = 2,
	ECancelMatchmakingReason_MAX   = 3
};


// Enum PWND.ERewardType
enum class ERewardType : uint8_t
{
	MatchComplete                  = 0,
	Victory                        = 1,
	FirstPlace                     = 2,
	SecondPlace                    = 3,
	ThirdPlace                     = 4,
	FirstWinOfTheDay               = 5,
	AccoladeFirst                  = 6,
	AccoladeSecond                 = 7,
	AccoladeThird                  = 8,
	ERewardType_MAX                = 9
};


// Enum PWND.EShieldBuckyBall
enum class EShieldBuckyBall : uint8_t
{
	SBBT_Goldberg_1                = 0,
	SBBT_Goldberg_101              = 1,
	SBBT_Goldberg_2                = 2,
	SBBT_Goldberg_MAX              = 3
};


// Enum PWND.ESpectateCameraMode
enum class ESpectateCameraMode : uint8_t
{
	SM_Free                        = 0,
	SM_Follow                      = 1,
	SM_Smart                       = 2,
	SM_COUNT                       = 3,
	SM_MAX                         = 4
};


// Enum PWND.eTelemetryClass
enum class EeTelemetryClass : uint8_t
{
	Tutorial                       = 0,
	Challenge                      = 1,
	Client                         = 2,
	GameEnd                        = 3,
	eTelemetryClass_MAX            = 4
};


// Enum PWND.ePwndMeshMaterialParamType
enum class EePwndMeshMaterialParamType : uint8_t
{
	None                           = 0,
	Scalar                         = 1,
	Vector                         = 2,
	Texture                        = 3,
	Material                       = 4,
	ePwndMeshMaterialParamType_MAX = 5
};


// Enum PWND.eTimeDilationEffect
enum class EeTimeDilationEffect : uint8_t
{
	Normal                         = 0,
	Action                         = 1,
	Movement                       = 2,
	Aiming                         = 3,
	eTimeDilationEffect_MAX        = 4
};


// Enum PWND.eVelocityInheritance
enum class EeVelocityInheritance : uint8_t
{
	None                           = 0,
	Full                           = 1,
	Parallel                       = 2,
	ParallelForward                = 3,
	ParallelReverse                = 4,
	Horizontal                     = 5,
	Vertical                       = 6,
	Horizontal_Parallel            = 7,
	Horizontal_ParallelForward     = 8,
	Horizontal_ParallelReverse     = 9,
	Vertical_Parallel              = 10,
	Vertical_ParallelForward       = 11,
	Vertical_ParallelReverse       = 12,
	eVelocityInheritance_MAX       = 13
};


// Enum PWND.eRatingType
enum class EeRatingType : uint8_t
{
	Unknown                        = 0,
	Pwn                            = 1,
	Damage                         = 2,
	Kill                           = 3,
	Assist                         = 4,
	Deny                           = 5,
	Revive                         = 6,
	Defend                         = 7,
	MAX                            = 8,
	eRatingType_MAX                = 9
};


// Enum PWND.eEventTriggerState
enum class EeEventTriggerState : uint8_t
{
	None                           = 0,
	AI                             = 1,
	Player                         = 2,
	Self                           = 3,
	OwnedAI                        = 4,
	Ally                           = 5,
	Enemy                          = 6,
	KillerOf                       = 7,
	Alive                          = 8,
	Pwnable                        = 9,
	Stacked                        = 10,
	Respawning                     = 11,
	Over0PctHeat                   = 12,
	Over25PctHeat                  = 13,
	Over50PctHeat                  = 14,
	Over75PctHeat                  = 15,
	Overheated                     = 16,
	RocketJumpDisabled             = 17,
	WeaponDisabled                 = 18,
	SkillDisabled                  = 19,
	AimingOffset                   = 20,
	Idle                           = 21,
	Dashing                        = 22,
	InAir                          = 23,
	Pwner                          = 24,
	Reviver                        = 25,
	Carrier                        = 26,
	Pwnee                          = 27,
	Revivee                        = 28,
	Carriee                        = 29,
	Surfing                        = 30,
	InShield                       = 31,
	InAShield                      = 32,
	InOwnShield                    = 33,
	InOthersShield                 = 34,
	InAllyShield                   = 35,
	InEnemyShield                  = 36,
	InPwnZone                      = 37,
	InAPwnZone                     = 38,
	PrevOther1                     = 39,
	PrevOther2                     = 40,
	PrevOther3                     = 41,
	PrevOther4                     = 42,
	PrevOther5                     = 43,
	MAX                            = 44,
	eEventTriggerState_MAX         = 45
};


// Enum PWND.eMathOperation
enum class EeMathOperation : uint8_t
{
	Max                            = 0,
	Min                            = 1,
	Average                        = 2,
	Multiply                       = 3,
	Add                            = 4,
	Subtract                       = 5,
	SubtractSwapped                = 6,
	Divide                         = 7,
	DivideSwapped                  = 8,
	Power                          = 9,
	PowerSwapped                   = 10,
	UseFirst                       = 11,
	UseSecond                      = 12,
	One                            = 13,
	Zero                           = 14,
	eMathOperation_MAX             = 15
};


// Enum PWND.EChatChannelType
enum class EChatChannelType : uint8_t
{
	Global                         = 0,
	Match                          = 1,
	Team                           = 2,
	Party                          = 3,
	System                         = 4,
	Announcement                   = 5,
	EChatChannelType_MAX           = 6
};


// Enum PWND.eRealm
enum class EeRealm : uint8_t
{
	Unknown                        = 0,
	Local                          = 1,
	Prototype                      = 2,
	Dev                            = 3,
	QA                             = 4,
	Stage                          = 5,
	Live                           = 6,
	eRealm_MAX                     = 7
};


// Enum PWND.eInGameTipsTrigger
enum class EeInGameTipsTrigger : uint8_t
{
	PreMatchWarmup                 = 0,
	CarryingEnemy                  = 1,
	DeadEnemyProximity             = 2,
	DeadAllyProximity              = 3,
	PwnDoublerProximity            = 4,
	GameTime                       = 5,
	MatchCount                     = 6,
	PrimaryAbilityUsedCount        = 7,
	SecondaryAbilityUsedCount      = 8,
	PwnCount                       = 9,
	PwnDoublerUseCount             = 10,
	ReviveCount                    = 11,
	CarryCount                     = 12,
	CarryPwnCount                  = 13,
	VerticalJumpCount              = 14,
	MovementAbilityUsedCount       = 15,
	eInGameTipsTrigger_MAX         = 16
};


// Enum PWND.EHostRelevantTeamButtonState
enum class EHostRelevantTeamButtonState : uint8_t
{
	HRTBS_EMPTY                    = 0,
	HRTBS_PENDING                  = 1,
	HRTBS_OCCUPIED                 = 2,
	HRTBS_READY                    = 3,
	HRTBS_MAX                      = 4
};


// Enum PWND.EBackendUserRole
enum class EBackendUserRole : uint8_t
{
	BUR_DEVELOPER                  = 0,
	BUR_USER                       = 1,
	BUR_PLAYER                     = 2,
	BUR_CUSTOMER_SERVICE           = 3,
	BUR_GAME_MODERATOR             = 4,
	BUR_GAME_ADMIN                 = 5,
	BUR_GAME_SERVER                = 6,
	BUR_MAX                        = 7
};


// Enum PWND.EPopUpSpawnType
enum class EPopUpSpawnType : uint8_t
{
	PUSPT_CONFIRMATION             = 0,
	PUSPT_ERROR_POPUP              = 1,
	PUSPT_LOADING_TRAINING         = 2,
	PUSPT_MAX                      = 3
};


// Enum PWND.eAimType
enum class EeAimType : uint8_t
{
	Reticle                        = 0,
	ReticleMuzzleBlend             = 1,
	Muzzle                         = 2,
	eAimType_MAX                   = 3
};


// Enum PWND.eWeaponAttachPoint
enum class EeWeaponAttachPoint : uint8_t
{
	None                           = 0,
	Holster                        = 1,
	Hands                          = 2,
	Loadout                        = 3,
	Weapon                         = 4,
	Weapon01                       = 5,
	Weapon02                       = 6,
	eWeaponAttachPoint_MAX         = 7
};


// Enum PWND.eWeaponArrayIndexMode
enum class EeWeaponArrayIndexMode : uint8_t
{
	Default                        = 0,
	ShotCount                      = 1,
	AmmoCountRemaining             = 2,
	AmmoPercentRemaining           = 3,
	ChargePct                      = 4,
	Distance                       = 5,
	eWeaponArrayIndexMode_MAX      = 6
};


// Enum PWND.eWeaponFireType
enum class EeWeaponFireType : uint8_t
{
	Projectile                     = 0,
	InstantHit                     = 1,
	Arc                            = 2,
	Beam                           = 3,
	Custom                         = 4,
	eWeaponFireType_MAX            = 5
};


// Enum PWND.eSpreadType
enum class EeSpreadType : uint8_t
{
	Random                         = 0,
	Fixed_H                        = 1,
	Fixed_V                        = 2,
	Circle                         = 3,
	Circle01                       = 4,
	Larson_H                       = 5,
	Larson_V                       = 6,
	BullsEye                       = 7,
	BullsEye01                     = 8,
	Spiral                         = 9,
	Spiral01                       = 10,
	DualSpiral                     = 11,
	CustomFixed                    = 12,
	eSpreadType_MAX                = 13
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct PWND.PwndLoadout
// 0x00B0
struct FPwndLoadout
{
	struct FGuid                                       Character;                                                // 0x0000(0x0010) (BlueprintVisible, IsPlainOldData)
	struct FGuid                                       CharacterSkin;                                            // 0x0010(0x0010) (BlueprintVisible, IsPlainOldData)
	struct FGuid                                       Weapon;                                                   // 0x0020(0x0010) (BlueprintVisible, IsPlainOldData)
	struct FGuid                                       WeaponSkin;                                               // 0x0030(0x0010) (BlueprintVisible, IsPlainOldData)
	struct FGuid                                       PrimaryAbility;                                           // 0x0040(0x0010) (BlueprintVisible, IsPlainOldData)
	struct FGuid                                       SecondaryAbility;                                         // 0x0050(0x0010) (BlueprintVisible, IsPlainOldData)
	struct FGuid                                       Perk;                                                     // 0x0060(0x0010) (BlueprintVisible, IsPlainOldData)
	struct FGuid                                       PWN;                                                      // 0x0070(0x0010) (BlueprintVisible, IsPlainOldData)
	struct FGuid                                       PwnStamp;                                                 // 0x0080(0x0010) (BlueprintVisible, IsPlainOldData)
	struct FGuid                                       Revive;                                                   // 0x0090(0x0010) (BlueprintVisible, IsPlainOldData)
	struct FGuid                                       CustomPwnLine;                                            // 0x00A0(0x0010) (BlueprintVisible, IsPlainOldData)
};

// ScriptStruct PWND.rontEnd_LoadoutButtonCharacterReferences
// 0x00C0
struct FrontEnd_LoadoutButtonCharacterReferences
{
	class UFrontEnd_UIButton*                          pFrontEndButton;                                          // 0x0000(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FPwndLoadout                                Loadout;                                                  // 0x0008(0x00B0)
	bool                                               bIsValid;                                                 // 0x00B8(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bIsVisible;                                               // 0x00B9(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x00BA(0x0006) MISSED OFFSET
};

// ScriptStruct PWND.FrontEnd_LoadoutCharacterSpawn
// 0x0040
struct FFrontEnd_LoadoutCharacterSpawn
{
	struct FTransform                                  Transform;                                                // 0x0000(0x0030) (Transient, IsPlainOldData)
	TArray<struct FTransform>                          BuddyTransforms;                                          // 0x0030(0x0010) (ZeroConstructor, Transient)
};

// ScriptStruct PWND.PurchasableEquipItem
// 0x0018
struct FPurchasableEquipItem
{
	struct FGuid                                       Guid;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	bool                                               bAlreadyOwned;                                            // 0x0010(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	int                                                cost;                                                     // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct PWND.OnlineFriendBPData
// 0x0038
struct FOnlineFriendBPData
{
	class UTexture2D*                                  pAvatarImage;                                             // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FString                                     Name;                                                     // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	int                                                progressionLevel;                                         // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FGuid                                       PlayerId;                                                 // 0x001C(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x002C(0x000C) MISSED OFFSET
};

// ScriptStruct PWND.GuidInventoryItem
// 0x0014
struct FGuidInventoryItem
{
	struct FGuid                                       Guid;                                                     // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	int                                                Quantity;                                                 // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct PWND.MissionInfo
// 0x0058
struct FMissionInfo
{
	struct FText                                       Title;                                                    // 0x0000(0x0018) (BlueprintVisible, BlueprintReadOnly)
	struct FText                                       Description;                                              // 0x0018(0x0018) (BlueprintVisible, BlueprintReadOnly)
	struct FText                                       ProgressType;                                             // 0x0030(0x0018) (BlueprintVisible, BlueprintReadOnly)
	float                                              CurrentProgress;                                          // 0x0048(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MaxProgress;                                              // 0x004C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                CoinQuantity;                                             // 0x0050(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                ExpQuantity;                                              // 0x0054(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct PWND.ActionMappings
// 0x0030
struct FActionMappings
{
	struct FInputActionKeyMapping                      Data;                                                     // 0x0000(0x0028)
	bool                                               bOverrided;                                               // 0x0028(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ScriptStruct PWND.AxisMappings
// 0x0030
struct FAxisMappings
{
	struct FInputAxisKeyMapping                        Data;                                                     // 0x0000(0x0028)
	bool                                               bOverrided;                                               // 0x0028(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
};

// ScriptStruct PWND.SettingFloatData
// 0x000C
struct FSettingFloatData
{
	int                                                Value;                                                    // 0x0000(0x0004) (ZeroConstructor, Config, IsPlainOldData)
	float                                              Min;                                                      // 0x0004(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              Max;                                                      // 0x0008(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct PWND.CharacterSettings
// 0x0058
struct FCharacterSettings
{
	TArray<struct FActionMappings>                     ActionMappings;                                           // 0x0000(0x0010) (ZeroConstructor)
	TArray<struct FAxisMappings>                       AxisMappings;                                             // 0x0010(0x0010) (ZeroConstructor)
	struct FSettingFloatData                           MouseSensitivity;                                         // 0x0020(0x000C) (IsPlainOldData)
	bool                                               MouseSensitivityOverrided;                                // 0x002C(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bMouseInverted;                                           // 0x002D(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bMouseInvertedOverrided;                                  // 0x002E(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x1];                                       // 0x002F(0x0001) MISSED OFFSET
	struct FSettingFloatData                           ControllerHorizontalSensitivity;                          // 0x0030(0x000C) (IsPlainOldData)
	bool                                               ControllerHorizontalSensitivityOverrided;                 // 0x003C(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x003D(0x0003) MISSED OFFSET
	struct FSettingFloatData                           ControllerVerticalSensitivity;                            // 0x0040(0x000C) (IsPlainOldData)
	bool                                               ControllerVerticalSensitivityOverrided;                   // 0x004C(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bControllerHorizontalInverted;                            // 0x004D(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bControllerHorizontalInvertedOverrided;                   // 0x004E(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bControllerVerticalInverted;                              // 0x004F(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bControllerVerticalInvertedOverrided;                     // 0x0050(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0051(0x0007) MISSED OFFSET
};

// ScriptStruct PWND.OptionsCache
// 0x0128
struct FOptionsCache
{
	class UPwndGameUserSettings*                       Settings;                                                 // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                DisplayMode;                                              // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FIntPoint                                   WindowedResolution;                                       // 0x000C(0x0008) (IsPlainOldData)
	struct FIntPoint                                   FullScreenResolution;                                     // 0x0014(0x0008) (IsPlainOldData)
	int                                                Gamma;                                                    // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ContrastMultiplier;                                       // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                GraphicsQuality;                                          // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bVSync;                                                   // 0x0028(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0029(0x0003) MISSED OFFSET
	int                                                Bloom;                                                    // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                DepthOfField;                                             // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                AmbientOcclusion;                                         // 0x0034(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                PostProcessQuality;                                       // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ShadowQuality;                                            // 0x003C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ViewDistanceQuality;                                      // 0x0040(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                AntiAliasingQuality;                                      // 0x0044(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                TextureQuality;                                           // 0x0048(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                EffectsQuality;                                           // 0x004C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                MotionBlur;                                               // 0x0050(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                MasterVolume;                                             // 0x0054(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                SFXVolume;                                                // 0x0058(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                MusicVolume;                                              // 0x005C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                InGameVoiceVolume;                                        // 0x0060(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                LobbyCharacterQuality;                                    // 0x0064(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                VoiceActivationMode;                                      // 0x0068(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                VoiceActivationThreshold;                                 // 0x006C(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               bAutoVoiceActivation;                                     // 0x0070(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bFilterChatEnabled;                                       // 0x0071(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0072(0x0002) MISSED OFFSET
	int                                                FOV;                                                      // 0x0074(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                FrameRate;                                                // 0x0078(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x007C(0x0004) MISSED OFFSET
	TMap<struct FGuid, struct FCharacterSettings>      CharacterSettingsData;                                    // 0x0080(0x0050) (ZeroConstructor)
	struct FCharacterSettings                          AllCharacterSettingsData;                                 // 0x00D0(0x0058)
};

// ScriptStruct PWND.ArrayOfInputWidgets
// 0x0010
struct FArrayOfInputWidgets
{
	unsigned char                                      UnknownData00[0x10];                                      // 0x0000(0x0010) MISSED OFFSET
};

// ScriptStruct PWND.OnlineFriendSocialBPData
// 0x0038
struct FOnlineFriendSocialBPData
{
	class UTexture2D*                                  pAvatarImage;                                             // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FString                                     Name;                                                     // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	int                                                progressionLevel;                                         // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsOnline;                                                // 0x001C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bIsLeader;                                                // 0x001D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x001E(0x0002) MISSED OFFSET
	struct FGuid                                       PlayerId;                                                 // 0x0020(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0030(0x0008) MISSED OFFSET
};

// ScriptStruct PWND.PwndStatAccumulator
// 0x0014
struct FPwndStatAccumulator
{
	int                                                Count;                                                    // 0x0000(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              Total;                                                    // 0x0004(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              Current;                                                  // 0x0008(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              MinVal;                                                   // 0x000C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              MaxVal;                                                   // 0x0010(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
};

// ScriptStruct PWND.PostMatchAccoladeData
// 0x000C
struct FPostMatchAccoladeData
{
	int                                                Type;                                                     // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Rank;                                                     // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                Value;                                                    // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct PWND.GUTSAttribute
// 0x0010
struct FGUTSAttribute
{
	struct FName                                       AttributeName;                                            // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bHasSubAttributes;                                        // 0x0008(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0009(0x0007) MISSED OFFSET
};

// ScriptStruct PWND.GUTSAttributeModifier
// 0x0038
struct FGUTSAttributeModifier
{
	struct FGUTSAttribute                              Attribute;                                                // 0x0000(0x0010) (Transient)
	class UObject*                                     OwnerDef;                                                 // 0x0010(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0018(0x0008) MISSED OFFSET
	class UProperty*                                   Property;                                                 // 0x0020(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              PreMul;                                                   // 0x0028(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              Add;                                                      // 0x002C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              PostMul;                                                  // 0x0030(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
};

// ScriptStruct PWND.GUTSAttributeModifierAccumulator
// 0x0020
struct FGUTSAttributeModifierAccumulator
{
	TArray<struct FGUTSAttributeModifier>              Modifiers;                                                // 0x0000(0x0010) (ZeroConstructor, Transient)
	bool                                               bIsTuning;                                                // 0x0010(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	int                                                TuningCount;                                              // 0x0014(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                TuningApplications;                                       // 0x0018(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct PWND.PostedEventTrigger
// 0x0018
struct FPostedEventTrigger
{
	TEnumAsByte<EeEventTrigger>                        Trigger;                                                  // 0x0000(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              Count;                                                    // 0x0004(0x0004) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	TArray<class UObject*>                             Others;                                                   // 0x0008(0x0010) (BlueprintVisible, ZeroConstructor, Transient)
};

// ScriptStruct PWND.PwndWeaponRepNonFiring
// 0x0008
struct FPwndWeaponRepNonFiring
{
	bool                                               bDetonateLiveProjectilesOnDrop;                           // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDetonateLiveProjectilesOnDeath;                          // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0002(0x0002) MISSED OFFSET
	int                                                MaxLiveProjectiles;                                       // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct PWND.RFloat
// 0x000C
struct FRFloat
{
	float                                              MinVal;                                                   // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxVal;                                                   // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseRange;                                                // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0009(0x0003) MISSED OFFSET
};

// ScriptStruct PWND.PwndWeaponRepOwnFiring
// 0x004C
struct FPwndWeaponRepOwnFiring
{
	float                                              FireInterval;                                             // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FireIntervalDeltaPerShot;                                 // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FRFloat                                     FireIntervalRange;                                        // 0x0008(0x000C) (Edit, BlueprintVisible)
	float                                              Heat;                                                     // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bFiringAllowRocketJump;                                   // 0x0018(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bStopFiringOnRocketJump;                                  // 0x0019(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowFiringWhenWeaponDisabled;                           // 0x001A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bAllowFireWhenOverheated;                                 // 0x001B(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bHeatResetCoolDelay;                                      // 0x001C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bHeatResetCoolRate;                                       // 0x001D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseSingleFireEvent;                                      // 0x001E(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bFireOnRelease;                                           // 0x001F(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              FiringMovementSpeedModifier;                              // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bStopDashOnFire;                                          // 0x0024(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDisableRefireOnHold;                                     // 0x0025(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0026(0x0002) MISSED OFFSET
	struct FRotator                                    FiringMaxAimSpeed;                                        // 0x0028(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	TEnumAsByte<EeWeaponFireType>                      WeaponFireType;                                           // 0x0034(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0035(0x0003) MISSED OFFSET
	float                                              FireIntervalForgiveness;                                  // 0x0038(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxLiveProjectilesForFiring;                              // 0x003C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FRFloat                                     CombatEffectiveRange;                                     // 0x0040(0x000C) (Edit, BlueprintVisible)
};

// ScriptStruct PWND.QInt
// 0x0014
struct FQInt
{
	bool                                               bQueried;                                                 // 0x0000(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	int                                                Value;                                                    // 0x0004(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                MinVal;                                                   // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                MaxVal;                                                   // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseRange;                                                // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
};

// ScriptStruct PWND.QIntExp
// 0x0004 (0x0018 - 0x0014)
struct FQIntExp : public FQInt
{
	float                                              Exp;                                                      // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct PWND.QFloat
// 0x0014
struct FQFloat
{
	bool                                               bQueried;                                                 // 0x0000(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0001(0x0003) MISSED OFFSET
	float                                              Value;                                                    // 0x0004(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              MinVal;                                                   // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxVal;                                                   // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bUseRange;                                                // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
};

// ScriptStruct PWND.QFloatExp
// 0x0004 (0x0018 - 0x0014)
struct FQFloatExp : public FQFloat
{
	float                                              Exp;                                                      // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

// ScriptStruct PWND.TimeDilationEffect
// 0x00A8
struct FTimeDilationEffect
{
	struct FQFloatExp                                  Dilation;                                                 // 0x0000(0x0018) (Edit)
	struct FQFloatExp                                  ActionDilation;                                           // 0x0018(0x0018) (Edit)
	struct FQFloatExp                                  MovementDilation;                                         // 0x0030(0x0018) (Edit)
	struct FQFloatExp                                  AimingDilation;                                           // 0x0048(0x0018) (Edit)
	struct FQFloatExp                                  Duration;                                                 // 0x0060(0x0018) (Edit)
	struct FQFloatExp                                  EaseInTime;                                               // 0x0078(0x0018) (Edit)
	struct FQFloatExp                                  EaseOutTime;                                              // 0x0090(0x0018) (Edit)
};

// ScriptStruct PWND.PwndActorClassFilter
// 0x0020
struct FPwndActorClassFilter
{
	TArray<TAssetPtr<class UClass>>                    AffectsFilter;                                            // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<TAssetPtr<class UClass>>                    IgnoresFilter;                                            // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
};

// ScriptStruct PWND.PwndDamageEvent
// 0x03C0 (0x0468 - 0x00A8)
struct FPwndDamageEvent : public FPointDamageEvent
{
	struct FQIntExp                                    DamageAmount;                                             // 0x00A8(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  MomentumAmount;                                           // 0x00C0(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  DamageTgtHeatMul;                                         // 0x00D8(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  DamageAttHeatMul;                                         // 0x00F0(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  DamageAttSpecialMovementCapacityMul;                      // 0x0108(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  HeatAmount;                                               // 0x0120(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  RJDelayTime;                                              // 0x0138(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  RJDisableTime;                                            // 0x0150(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  SpecialMovementDisableTime;                               // 0x0168(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  MovementDisableTime;                                      // 0x0180(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  WeapDisableTime;                                          // 0x0198(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  AbilityDisableTime;                                       // 0x01B0(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  AimOffsetTime;                                            // 0x01C8(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  AimOffsetDeg;                                             // 0x01E0(0x0018) (Edit, BlueprintVisible)
	struct FTimeDilationEffect                         TimeDilationEffect;                                       // 0x01F8(0x00A8) (Edit, BlueprintVisible)
	struct FQFloatExp                                  PwnTimerAdd;                                              // 0x02A0(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  ReviveTimerAdd;                                           // 0x02B8(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  RespawnTimerAdd;                                          // 0x02D0(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  HealthEffectiveness;                                      // 0x02E8(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  ArmorEffectiveness;                                       // 0x0300(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  ShieldEffectiveness;                                      // 0x0318(0x0018) (Edit, BlueprintVisible)
	struct FQFloatExp                                  DamageReductionEffectiveness;                             // 0x0330(0x0018) (Edit, BlueprintVisible)
