#pragma once

// PWND (4.17.2.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct ControlMappingKeys.ControlMappingKeys
// 0x0040
struct FControlMappingKeys
{
	struct FString                                     Key_2_75011B28429296E87EB27DAC6575F539;                   // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     String_Keyboard_13_48E7162D4E06B2C135B42BBAA71E0ED1;      // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UTexture2D*                                  Icon_Keyboard_9_742A511144BD141DC94F768E53D78E38;         // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     String_Gamepad_12_CA6770944F88D669A7F7FB9D8A36D220;       // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class UTexture2D*                                  Icon_Gamepad_11_A1FEDD884CBE4A7D215AD09F201F6117;         // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
