#pragma once

// PWND (4.17.2.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Base_Character_AnimBP.Base_Character_AnimBP_C
// 0x5C18 (0x6168 - 0x0550)
class UBase_Character_AnimBP_C : public UPwndAnimInstanceCharacter
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0550(0x0008) (Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_432B7CEA4CB8391D29A3708B841FAEDF;      // 0x0558(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FA2A241345BE8CEF0FA342AEA24CFBE2;// 0x05A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_98ADC9A84D1E1AA31507188220F166BD;// 0x0620(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CB9C1DD24EF4E412D98C7E9F1714E968;// 0x06A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C94783124B02EB3005368E8CC4BF3283;// 0x0720(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_50CD91A840ACA40E7A8B61A686EEFD97;// 0x07A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_84B4783642CF6CADBFD138B3273E1FA5;// 0x0820(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_60C50F054FCE7627C1E06DB2A082B293;// 0x08A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EFB40D67459A2600757B6C88ADFF1F96;// 0x0920(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EA44198946D878457A64CF8E675D9940;// 0x09A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_868A6C7243DE1ECA39E73D905F1BB5BD;// 0x0A20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_87342BF64E5A2FDE8F28E08BA5F347EA;// 0x0AA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7357EFF3403D089100ED63B66C36F571;// 0x0B20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C82B961D409436EB2563A0BA8C672CB5;// 0x0BA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_120692B542BE91C1978E89A2FFFAFF8A;// 0x0C20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_83CEF48E4AB8176D326A9DBDE62B1C7E;// 0x0CA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F8F489CE4420822F981A7D8DE6FED595;// 0x0D20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1471868E450AC4659C3ED89643E6D5E9;// 0x0DA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F702D3F84AFE7396A5E773A4E6B5F3B0;// 0x0E20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7B88BDD448FE301E7D1EE399C341C12B;// 0x0EA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0A1E8F344BF074404F4FA382521F483F;// 0x0F20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_52DA2DC045A6342BDD0B72AEFAA0675A;// 0x0FA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_8712817D42886E4282C2FEA47B8A968F;// 0x1020(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_289488694B4E471ED58F6392223253E9;// 0x10A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DD7C920B4157DA6E638FCBA51E8C5A41;// 0x1120(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4AC9123F48459005919DF5A3202AC0F4;// 0x11A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_5A4DA89645993619097F3197AE04C666;// 0x1220(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_59533C194EDBE102625CFE96E61045E3;// 0x12A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4266B5B34E0B42A2E4CF02A3DE0B3386;// 0x1320(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3659B02F455D0B0399DFFFB4B5B7FCFE;// 0x13A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A7CA0B33488A247FE462EDA7DB9DB903;// 0x1420(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_454075F54AFBEFA5053AB68943607574;// 0x14A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_124712AA48613BBE4A54719517D29172;// 0x1520(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C656C9D84E6997ECB142549313DE148A;// 0x15A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_691D47A743B0E4B9B67D2AAC0013A6E3;// 0x1620(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3B68C80648469F7FE83E9B95F50C8DAF;// 0x16A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1F3DC3B4461D3963FF8EAE8E7EB0177A;// 0x1720(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FBD52E804112C598E07C5C806B67DF32;// 0x17A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_45A00A7043D76081FFFAC2945E01F5D6;// 0x1820(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D006F04B4511B0063D562E9E2A38D5B3;// 0x18A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F2E82726470FB0F5BC9C0E9846CCD3CF;// 0x1920(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EE568A4549B14DDB8257508689821BF2;// 0x19A0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_CB6F748742C3F2CDFEA7E2BA4F680C44;// 0x1A20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_7DCB3CA945CF2E3E5BB9339427E38655;// 0x1AA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AB454B8F47233BB6024BC89688892CAA;// 0x1B20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C4C6CAC241E9FA3D124609AC1C486096;// 0x1BA0(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6B5C69844402C707A183A5BF2CE4DD5A;// 0x1C20(0x0080)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_C36763004EEC5F7CFC19EA99FE393F31;// 0x1CA0(0x0080)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_82C1130E496123350634BFB915A15890;// 0x1D20(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2E3983D4477A7DA7859BE2AFB22100D22;// 0x1D90(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3B492B29481FB9A4D42AD8A8396ABF85;// 0x1DD8(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2CA141214BB18A10D938D2B3A3FE0E2E;// 0x1E48(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_10CADE204E6D3C0C4560DAAA1F3AD5C8;// 0x1E90(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_49F9C17C41FE322CF6F9B7B18DB9097F;// 0x1F00(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_121F99E54DA5384776D6BFA35B8F8322;// 0x1F48(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_DABC0EF045BA75C565329285F9A0BEED;// 0x1FB8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9FC950484634896BB1D2A78CD043386E;// 0x2000(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8FF253C8439694A89A5E8A838D962146;// 0x2070(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B554BDE54C2AFE53F0922B8A5FA0AF0B;// 0x2140(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BEE267374646C825A9B006A98D058B4E;// 0x2268(0x00D0)
	struct FPwndAnimNode_RotationOffsetBlendSpace      PwndAnimGraphNode_RotationOffsetBlendSpace_205100064362A320D8BF5AB162165DF8;// 0x2338(0x0160)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_42C63CA84116B586DB0E2187256B5DB0;// 0x2498(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A373DD4540B0A39D3CFC1AA8B276575F;// 0x2508(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F1E1E52A4B19181EFEC92DBAC671DA53;// 0x25D8(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_2E3983D4477A7DA7859BE2AFB22100D2;// 0x2700(0x0048)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_75503E0D42B1718AC5701EA43F7FAD6C;// 0x2748(0x0158)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6B41983D41AB88CEBB85839C66334978;// 0x28A0(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_B28DF3564ADDAB5EA729DBB0B56B2941;// 0x2910(0x0048)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_26824A5A4BCCF762E75AB1A5FCECDDA7;// 0x2958(0x0158)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BA269B284AD1F5151329238650DEC757;// 0x2AB0(0x0128)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_365D6C9148658141407803AA5CD9AAEA;// 0x2BD8(0x0048)
	struct FPwndAnimNode_Crawling                      PwndAnimGraphNode_Crawling_CD6A9BF4479664AB95A281AE2F4657A5;// 0x2C20(0x0218)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_6DAFD0154973A9631DEEF49037B57069;// 0x2E38(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_8E8E4EF648D13454004FBBB80B8695D6;// 0x2E80(0x0048)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_44C3CEBD43C27589412F37A93F14FE3C;// 0x2EC8(0x0158)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_534E7CF94DBAC2354BACC7881FC19453;// 0x3020(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_84E931FF4CD9B16F53EA9E8DF9D1E1E6;// 0x3148(0x0070)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_631A02854D94BFC99015598E63304D0B;// 0x31B8(0x00E0)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_54DF993D42773A2CB3EEBDAA18F4642E;// 0x3298(0x0048)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_2CAFCE50402130034E05C7A5F15E8915;// 0x32E0(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FFD8CC314E615DD48F31108C4238AEF6;// 0x33C0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_276FF2F84D807C64AFADC088E1A550C8;// 0x3430(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_07241B644CBB3323242BA98E54A0F882;// 0x34A0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D531B3924C9D519858FA2DA4C254FADF;// 0x3510(0x0070)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_F42E532046BBF73EFF807BA90EA6726F;// 0x3580(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1A2B1A624CD0EE7BA12CA687E097CE27;// 0x35C8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_80103C6B4A7B3ED5324956B6C2F5591C;// 0x3638(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_03F1E5FE41C227443C435DA21D4D3B06;// 0x36A8(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_EB96E2554D03793C8D6F0EA6B2B28C42;// 0x3718(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D472C39D4A4DC3183B74D9897A37B354;// 0x37E8(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_8DA2BD404BBC1A657D0921914D5C12A6;// 0x3858(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_249A02D741157BE53D803B83DA2B541A;// 0x3928(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C92A1C65445B6D855249E39B2FF617F3;// 0x3998(0x00D0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E5F6A94E42C92A7B9CCCE98C64DD802A;// 0x3A68(0x00D0)
	struct FPwndAnimNode_Crawling                      PwndAnimGraphNode_Crawling_42BC132841278E0EFA23088C6BB86587;// 0x3B38(0x0218)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_71EA70724CEDF05ABD0335B8FFF70126;// 0x3D50(0x0048)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_90C911A8410650E4800D50A77C8E76B0;// 0x3D98(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BFBAE3FC4DABB1D02912BDAAC8707A02;// 0x3DE0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_F10C7D674A5C03CB2BAB9AA87F5E3904;// 0x3F08(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_02C3270A4AE3C25F4CF676A6CEE64173;// 0x4030(0x0128)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0AE429FB47728A006540968341C9FE41;// 0x4158(0x0070)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_716D6BD64AFD00C9EA0F9D9E1B8F8056;// 0x41C8(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_369C81E0448A6829C51695999EEC4CEB;// 0x4240(0x0070)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_FD968ED64FF5EA36A2E275B580D74439;// 0x42B0(0x0078)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_34E2BED6459773CC7578C494A6829D18;// 0x4328(0x00D0)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_2C16E5DD4BE35784199BFCA81B31A17E;// 0x43F8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A68FACEA44605B4E359C44947973AA62;// 0x44C8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_41E742C947E6FD740DFF47BFAC882BBA;// 0x4538(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9E490D8A424131551FE18DA9A33B8953;// 0x45A8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_422C834E478ED623F722E6B1A7CB466B;// 0x4618(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0D1DE1244C4C133994F10FB8F45D81DA;// 0x4688(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_5CB9581E41D965ED233AA09B84C64AE8;// 0x46F8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_86D73BA34CC7F9B0BBB7E7B6807C6DF6;// 0x47C8(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E8CE6A8048CD5AA288FE9CB4686A8215;// 0x4838(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_99F609774F2325373904739BE41781F5;// 0x4908(0x0128)
	struct FPwndAnimNode_InteractionRevivePlayer       PwndAnimGraphNode_InteractionRevivePlayer_D3ABBF12415A6641C518D39430EA0E20;// 0x4A30(0x0070)
	struct FPwndAnimNode_InteractionPWNPlayer          PwndAnimGraphNode_InteractionPWNPlayer_974DE0C7494A61954059079CEFAFA2E6;// 0x4AA0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F0CA92EA45D61002F3398888ABC16824;// 0x4B10(0x0070)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_2F6A80694C8F1CBD1711D3BFF7737B00;// 0x4B80(0x0158)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_D5E5343243AA4C2BDFCC32ADD487812A;// 0x4CD8(0x0158)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_05331B8D41ACD56184C24E96AC108E87;// 0x4E30(0x00E0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4859D809436C33EE412E4987E6ACADB3;// 0x4F10(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7A0457F34DA4BB624FD0309E09BCD002;// 0x4F80(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C8DF333E4CEF2616185C23BFD61B1B2F;// 0x4FF0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8BE23E1645D0D9C07D915D938EC93CF0;// 0x5060(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6838C053457AE70B672C43ADA90A3820;// 0x50D0(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4B3BAD6249BF5BB173D520AD87F5E650;// 0x5140(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1300CFAE4156CA6214D71B864A91B00C;// 0x51B0(0x0070)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt_F63B691747704B10C9639FA75638B63D;// 0x5220(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_5FC752CA460F3C0295A7829C628AC13B;// 0x52F0(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_053313D4434013C34A3E2D96301309D7;// 0x5418(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_FA9839C348415B8D66E2B6BAADB6C63A;// 0x54E8(0x0070)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_563497A6432B5B40A9C800900541E8E1;// 0x5558(0x0070)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_A8748275432EA19040FE1680581E4762;// 0x55C8(0x00D0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_FE2DD73746B662F9FCEDCF878BF6D1CE;// 0x5698(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_D3B4FE30467985E84CFDAA9B08F842DF;// 0x57C0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_00228E804D335A004100AE9734071240;// 0x5890(0x0070)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_29E0923E4DF1878F910C2AA64AC72D7C;// 0x5900(0x0078)
	struct FAnimNode_Root                              AnimGraphNode_StateResult_C30BC6D8400FD948F2A1C0A9BC12FAF5;// 0x5978(0x0048)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_3225E77949A6AD8DB268F7B4A170A5E5;// 0x59C0(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_67DE3E90406A81FFE97E8B880F718CB0;// 0x5A98(0x00A8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D503DB344C1A14C6CA70158779036327;// 0x5B40(0x0050)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_43AF5A514F2E03C028AF439732171FEC;// 0x5B90(0x00E0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F5B626234184AAC63E7F0CBE758BE332;// 0x5C70(0x0050)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_91C613B8455E9C8BC8245C952728633C;      // 0x5CC0(0x0060)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_A5B780CA4948E7E4D36EA594CA5AEDE8;      // 0x5D20(0x0060)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_B00AB1644FF64C8182E3749E5AFAFFC0;// 0x5D80(0x00A8)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E0810CA442BFE4155872D0BC7D382B9C;// 0x5E28(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_B8A9CCA2435BD28F66023ABDE8BC7EEB;// 0x5EF8(0x0050)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_9CF58580411AA3E321E3759E8D21803F;// 0x5F48(0x0050)
	struct FPwndAnimNode_HandIK                        PwndAnimGraphNode_HandIK_9F654EE740D31A2417C5068BBD4BDC7C;// 0x5F98(0x0110)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_44714773461F89EABBBAE68003BC0271;// 0x60A8(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C1ED3B4C47E1B3EC8CBF2DAB7F39FC1C;// 0x60F0(0x0048)
	float                                              CrawlPlayRateModifier;                                    // 0x6138(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              CrawlSprintPlayRateModifier;                              // 0x613C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UBlendSpace*                                 RocketJumpBlendSpaceOverride;                             // 0x6140(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               RocketJumpDOverride;                                      // 0x6148(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               PlayCustomMoveSequence;                                   // 0x6150(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x6151(0x0007) MISSED OFFSET
	class UAnimSequence*                               CustomMoveSequence;                                       // 0x6158(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               AllowDash;                                                // 0x6160(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x6161(0x0003) MISSED OFFSET
	float                                              BlendFromSprintTime;                                      // 0x6164(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Base_Character_AnimBP.Base_Character_AnimBP_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_Base_Character_AnimBP_AnimGraphNode_TransitionResult_A7CA0B33488A247FE462EDA7DB9DB903();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Base_Character_AnimBP_AnimGraphNode_TransitionResult_454075F54AFBEFA5053AB68943607574();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Base_Character_AnimBP_AnimGraphNode_TransitionResult_124712AA48613BBE4A54719517D29172();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Base_Character_AnimBP_AnimGraphNode_TransitionResult_8712817D42886E4282C2FEA47B8A968F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Base_Character_AnimBP_AnimGraphNode_TransitionResult_C656C9D84E6997ECB142549313DE148A();
