#pragma once

// PWND (4.17.2.0) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class PWND.BaseWidgetInterface
// 0x00A0 (0x02D0 - 0x0230)
class UBaseWidgetInterface : public UUserWidget
{
public:
	class UClass*                                      TrainingScreen;                                           // 0x0230(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UUserWidget*                                 pTrainingScreen;                                          // 0x0238(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UClass*                                      ChallengesScreen;                                         // 0x0240(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UUserWidget*                                 pChallengesScreen;                                        // 0x0248(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UClass*                                      DebugLoadoutScreen;                                       // 0x0250(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UUserWidget*                                 pDebugLoadoutScreen;                                      // 0x0258(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UClass*                                      GenericConfirmationPopUp;                                 // 0x0260(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UUserWidget*                                 pGenericConfirmationPopUp;                                // 0x0268(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UClass*                                      GenericErrorPopup;                                        // 0x0270(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UUserWidget*                                 pGenericErrorPopUp;                                       // 0x0278(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UClass*                                      TrainingLoadingPopup;                                     // 0x0280(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UUserWidget*                                 pTrainingLoadingPopup;                                    // 0x0288(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	TArray<class UUserWidget*>                         pPopUpQueue;                                              // 0x0290(0x0010) (ExportObject, ZeroConstructor, Transient)
	class UUserWidget*                                 pCurrentScreen;                                           // 0x02A0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UUserWidget*                                 pPreviousScreen;                                          // 0x02A8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UClass*                                      OptionsScreen;                                            // 0x02B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UUserWidget*                                 pOptionsScreen;                                           // 0x02B8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UCanvasPanel*                                pScreensCanvasPanel;                                      // 0x02C0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UCanvasPanel*                                pPopUpCanvasPanel;                                        // 0x02C8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.BaseWidgetInterface");
		return ptr;
	}


	void OnArrivedToOptionsScreen();
	void LeaveOptionsScreen();
	void GoToTrainingScreen();
	void GoToOptionsScreen();
	void GoToChallengeScreen();
	class UUserWidget* GetCurrentScreen();
};


// Class PWND.FrontEnd_BaseScreen
// 0x0040 (0x0270 - 0x0230)
class UFrontEnd_BaseScreen : public UUserWidget
{
public:
	class UBaseWidgetInterface*                        pWidgetInterface;                                         // 0x0230(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x38];                                      // 0x0238(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_BaseScreen");
		return ptr;
	}


	void RequestExitScreen();
	void RegisterWidgetAnimation(class UWidgetAnimation* pWidgetAnimation);
	void RegisterNavigableElement(class UUI_MenuNavigable* pNewNavigable);
	void OnSafeInitialization();
	void OnNewWidgetReceiveAttention(class UUI_MenuNavigable* WidgetWithAttention);
	void OnExitScreen();
	void OnEnterScreen();
	void OnBumperRight();
	void OnBumperLeft();
	void OnBack();
	class UUI_MenuNavigable* GetCurrentNavigableThatHasAttention();
	void ForceNavigableObjectSelection(class UUserWidget* pNavigableObject);
	void ClearNavigationAttention();
};


// Class PWND.FrontEnd_ChallengesScreen
// 0x0000 (0x0270 - 0x0270)
class UFrontEnd_ChallengesScreen : public UFrontEnd_BaseScreen
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_ChallengesScreen");
		return ptr;
	}

};


// Class PWND.FrontEnd_CharacterSelectScreen
// 0x0108 (0x0378 - 0x0270)
class UFrontEnd_CharacterSelectScreen : public UFrontEnd_BaseScreen
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0270(0x0008) MISSED OFFSET
	class UClass*                                      CharacterButtonWidgetToUse;                               // 0x0278(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	float                                              xButtonPosition;                                          // 0x0280(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	float                                              yInitialButtonPosition;                                   // 0x0284(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	float                                              yButtonOffsets;                                           // 0x0288(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	float                                              ButtonHeights;                                            // 0x028C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	float                                              ButtonWidths;                                             // 0x0290(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	int                                                ButtonLabelFontSize;                                      // 0x0294(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	TArray<struct FrontEnd_LoadoutButtonCharacterReferences> AllCharacterButtons;                                      // 0x0298(0x0010) (ZeroConstructor, Transient)
	TArray<struct FFrontEnd_LoadoutCharacterSpawn>     SpawnReferenceTransforms;                                 // 0x02A8(0x0010) (ZeroConstructor, Transient)
	class APwndLoadoutVisualizerHelper*                pVisualizerHelper;                                        // 0x02B8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UTexture2D*                                  LoadingIcon;                                              // 0x02C0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UWidgetAnimation*                            pDefaultAnim;                                             // 0x02C8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UWidgetAnimation*                            pCharacterCustomizationSlideIntoViewAnim;                 // 0x02D0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UWidgetAnimation*                            pCharacterCustomizationSlideOutOfViewAnim;                // 0x02D8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UTextBlock*                                  pCharacterNameWidgetText;                                 // 0x02E0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UUI_TextureSwapButton*                       pMakeActiveButton;                                        // 0x02E8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UUI_TextureSwapButton*                       pCustomizeAppearanceButton;                               // 0x02F0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UFrontEnd_UIButtonLoadoutItem*               pCharacterSkinLoadoutItem;                                // 0x02F8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UFrontEnd_UIButtonLoadoutItem*               pPrimaryWeaponLoadoutItem;                                // 0x0300(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UFrontEnd_UIButtonLoadoutItem*               pWeaponSkinLoadoutItem;                                   // 0x0308(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UFrontEnd_UIButtonLoadoutItem*               pPrimaryAbilityLoadoutItem;                               // 0x0310(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UFrontEnd_UIButtonLoadoutItem*               pSecondaryAbilityLoadoutItem;                             // 0x0318(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UFrontEnd_UIButtonLoadoutItem*               pPerk1LoadoutItem;                                        // 0x0320(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UFrontEnd_UIButtonLoadoutItem*               pPerk2LoadoutItem;                                        // 0x0328(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UFrontEnd_UIButtonLoadoutItem*               pPerk3LoadoutItem;                                        // 0x0330(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UFrontEnd_UIButtonLoadoutItem*               pPwnLoadoutItem;                                          // 0x0338(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UFrontEnd_UIButtonLoadoutItem*               pPwnStampLoadoutItem;                                     // 0x0340(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UFrontEnd_UIButtonLoadoutItem*               pReviveLoadoutItem;                                       // 0x0348(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UUI_SelectionHighlighter*                    pHighlighter;                                             // 0x0350(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      pLoadoutVisualization;                                    // 0x0358(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	int                                                CurrentlySelectedCharacter;                               // 0x0360(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                CurrentlyActiveLoadout;                                   // 0x0364(0x0004) (ZeroConstructor, IsPlainOldData)
	class UCanvasPanel*                                pCanvasPanel;                                             // 0x0368(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0370(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_CharacterSelectScreen");
		return ptr;
	}


	void ShiftAttentionToRightSideOfScreen();
	void SetEncapsulatingCanvasPanel(class UCanvasPanel* CanvasPanel);
	void SetActiveLoadout();
	void SelectNextWeaponSkin();
	void SelectNextSecondaryAbility();
	void SelectNextRevive();
	void SelectNextPwnStamp();
	void SelectNextPwn();
	void SelectNextPrimaryWeapon();
	void SelectNextPrimaryAbility();
	void SelectNextPerk3();
	void SelectNextPerk2();
	void SelectNextPerk1();
	void SelectNextCharacterSkin();
	void OnGoBackToMainMenu();
	void OnCustomReset();
	void OnBack_Implementation();
};


// Class PWND.FrontEnd_CreateAccountScreen
// 0x0330 (0x05A0 - 0x0270)
class UFrontEnd_CreateAccountScreen : public UFrontEnd_BaseScreen
{
public:
	class UClass*                                      PopUpErrorScreen;                                         // 0x0270(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UUserWidget*                                 pPopUpErrorScreen;                                        // 0x0278(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UUI_TextureSwapButton*                       pGoBackButton;                                            // 0x0280(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UUI_TextureSwapButton*                       pCreateAccountButton;                                     // 0x0288(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UEditableTextBox*                            pFirstNameTextField;                                      // 0x0290(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UEditableTextBox*                            pLastNameTextField;                                       // 0x0298(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UEditableTextBox*                            pUserNameTextField;                                       // 0x02A0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UEditableTextBox*                            pPassword1TextField;                                      // 0x02A8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UEditableTextBox*                            pPassword2TextField;                                      // 0x02B0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2E8];                                     // 0x02B8(0x02E8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_CreateAccountScreen");
		return ptr;
	}


	void OnGoBackPressed();
	void OnCreateAccountPressed();
	void CloseErrorScreen();
};


// Class PWND.FrontEnd_CreateCustomMatchScreen
// 0x0030 (0x02A0 - 0x0270)
class UFrontEnd_CreateCustomMatchScreen : public UFrontEnd_BaseScreen
{
public:
	class UDataTable*                                  pCustomMatchPointsDT;                                     // 0x0270(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UDataTable*                                  pCustomMatchDurationDT;                                   // 0x0278(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UDataTable*                                  pCustomMatchTeamSizeDT;                                   // 0x0280(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UUI_GeneralUseCaseButton*                    pMapButton;                                               // 0x0288(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0290(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_CreateCustomMatchScreen");
		return ptr;
	}


	void PressCreateButton();
	class UTexture2D* OnMapHighlighted(int Index);
	void AllPointOptionsAcquired(TArray<struct FText> displayTextArray);
	void AllMatchTeamSizeOptionsAcquired(TArray<struct FText> displayTextArray);
	void AllMatchDurationOptionsAcquired(TArray<struct FText> displayTextArray);
	void AllLevelNamesAcquired(TArray<struct FText> LevelNames);
};


// Class PWND.FrontEnd_CustomizeScreen
// 0x00C8 (0x0338 - 0x0270)
class UFrontEnd_CustomizeScreen : public UFrontEnd_BaseScreen
{
public:
	unsigned char                                      UnknownData00[0xC8];                                      // 0x0270(0x00C8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_CustomizeScreen");
		return ptr;
	}


	void PurchaseItemCallBack(bool bSucceeded, const struct FText& ErrorMessage);
	bool PurchaseItem(const struct FGuid& ItemGUID, const struct FGuid& CostItemGUID);
	void OnUpdatedInventoryReceived();
	void OnLeftFaceButton();
	void OnAccept();
	struct FPwndLoadout NotifyOfViewedWeaponSkin(const struct FGuid& weaponSkinGuid);
	struct FPwndLoadout NotifyOfViewedWeapon(const struct FGuid& weaponGuid);
	struct FPwndLoadout NotifyOfViewedVoiceLine(const struct FGuid& voiceLineGuid);
	struct FPwndLoadout NotifyOfViewedReviveAnim(const struct FGuid& reviveAnimGuid);
	struct FPwndLoadout NotifyOfViewedPwnStamp(const struct FGuid& pwnStampGuid);
	struct FPwndLoadout NotifyOfViewedPwnAnim(const struct FGuid& pwnAnimGuid);
	struct FPwndLoadout NotifyOfViewedCharacterSkin(const struct FGuid& skinGuid);
	struct FPwndLoadout NotifyOfCharacterToView(const struct FGuid& characterGuid);
	int GetTotalAmountOfWeaponSkins(const struct FGuid& weaponGuid);
	int GetTotalAmountOfWeapons(const struct FGuid& characterGuid);
	int GetTotalAmountOfPwnVoiceLines(const struct FGuid& characterGuid);
	int GetTotalAmountOfPwnStamps(const struct FGuid& characterGuid);
	int GetTotalAmountOfPwnAnimations(const struct FGuid& characterGuid);
	int GetTotalAmountOfOwnedWeaponSkins(const struct FGuid& weaponGuid);
	int GetTotalAmountOfOwnedWeapons(const struct FGuid& characterGuid);
	int GetTotalAmountOfOwnedPwnVoiceLines(const struct FGuid& characterGuid);
	int GetTotalAmountOfOwnedPwnStamps(const struct FGuid& characterGuid);
	int GetTotalAmountOfOwnedPwnAnimations(const struct FGuid& characterGuid);
	int GetTotalAmountOfOwnedCharacterSkins(const struct FGuid& characterGuid);
	int GetTotalAmountOfCharacterSkins(const struct FGuid& characterGuid);
	struct FGuid GetEquippedWeaponSkin(const struct FGuid& weaponGuid);
	struct FGuid GetEquippedWeapon(const struct FGuid& characterGuid);
	struct FGuid GetEquippedVoiceLine(const struct FGuid& characterGuid);
	struct FGuid GetEquippedSkin(const struct FGuid& characterGuid);
	struct FGuid GetEquippedPwnStamp(const struct FGuid& characterGuid);
	struct FGuid GetEquippedPwnAnimation(const struct FGuid& characterGuid);
	TArray<struct FGuid> GetAvailableCharacters();
	TArray<struct FPurchasableEquipItem> GetAllWeaponSkinEquips(const struct FGuid& weaponGuid);
	TArray<struct FPurchasableEquipItem> GetAllWeaponsEquips(const struct FGuid& characterGuid);
	TArray<struct FPurchasableEquipItem> GetAllPwnVoiceLineEquips(const struct FGuid& characterGuid);
	TArray<struct FPurchasableEquipItem> GetAllPwnStampEquips(const struct FGuid& characterGuid);
	TArray<struct FPurchasableEquipItem> GetAllPwnAnimationEquips(const struct FGuid& characterGuid);
	TArray<struct FPurchasableEquipItem> GetAllCharacterSkinEquips(const struct FGuid& characterGuid);
	void Equip(const struct FGuid& equipObjectID);
};


// Class PWND.FrontEnd_ErrorScreen
// 0x0018 (0x0288 - 0x0270)
class UFrontEnd_ErrorScreen : public UFrontEnd_BaseScreen
{
public:
	class UTextBlock*                                  pErrorMessage;                                            // 0x0270(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	TArray<struct FText>                               ErrorMessages;                                            // 0x0278(0x0010) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_ErrorScreen");
		return ptr;
	}


	void HideErrorScreen();
};


// Class PWND.FrontEnd_EulaNdaScreen
// 0x0000 (0x0270 - 0x0270)
class UFrontEnd_EulaNdaScreen : public UFrontEnd_BaseScreen
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_EulaNdaScreen");
		return ptr;
	}


	void OnCancelPressed();
	void OnAcceptPressed();
};


// Class PWND.FrontEnd_LobbyScreen
// 0x0160 (0x03D0 - 0x0270)
class UFrontEnd_LobbyScreen : public UFrontEnd_BaseScreen
{
public:
	class UDataTable*                                  pCustomMatchPointsDT;                                     // 0x0270(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	class UDataTable*                                  pCustomMatchDurationDT;                                   // 0x0278(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	TArray<struct FrontEnd_LoadoutButtonCharacterReferences> AllCharacterButtons;                                      // 0x0280(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData00[0x128];                                     // 0x0290(0x0128) MISSED OFFSET
	class UPwndGameUserSettings*                       Settings;                                                 // 0x03B8(0x0008) (ZeroConstructor, IsPlainOldData)
	class UUI_SelectableGroup*                         pCharacterSelectionGroup;                                 // 0x03C0(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x03C8(0x0001) MISSED OFFSET
	bool                                               bCharacterInfoDisplayed;                                  // 0x03C9(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bScoreboardDisplayed;                                     // 0x03CA(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x5];                                       // 0x03CB(0x0005) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_LobbyScreen");
		return ptr;
	}


	void UnevenNumberOfPlayersAlert();
	void SwitchTeams(const struct FOnlineFriendBPData& lobbyMember);
	void SwapSlots(const struct FOnlineFriendBPData& lobbyMemberA, const struct FOnlineFriendBPData& lobbyMemberB);
	void ShowTeamsButtonPressed();
	void ShowTeamLoadoutButtonPressed();
	void SetReadyState(bool bIsReady);
	void SetCurrentGameMode(int selectedGameModeIndex);
	int SelectRandomLoaodut(bool bEvenOutCharacterSelection, bool bIncludeEnemyTeam, bool bOnlyReady);
	void SelectLoadoutFromList(int indexOfSelected);
	void ScoreboardVisible(bool IsVisible);
	void SaveMatchSettings(int selectedLevelIndex, int selectedPointsIndex, int selectedDurationIndex, int selectedGameModeIndex, int autoFillBotDifficultyIndex);
	void RequestLeaveLobby();
	void RequestFriendsList();
	void ProvideAvailableCharacterNames(TArray<struct FText> characterNames);
	void ProvideAvailableCharacterGuids(TArray<struct FGuid> allCharacterGuids);
	void PressReadyButton();
	void PressChangeCharacterButton();
	void PlayerAbandonedLobby();
	void PenalizePlayerForLeaving();
	void PassCharacterSelectionGroupReference(class UUI_SelectableGroup* pSelectionGroup);
	void PassCharacterDropDownScalable(class UUI_DropDownScalable* pCharacterDropDown);
	void OpenLoadoutPage();
	void OnSpecialEscapeButtonPressed();
	void OnSlotUpdated(const struct FOnlineFriendBPData& playerData, TEnumAsByte<EHostRelevantTeamButtonState> buttonState, const struct FPwndLoadout& Loadout, int teamIndex, int SlotIndex);
	void OnServerReadyToJoin();
	void OnServerReadyToBeSpunUp();
	void OnReceivedFriendsList(TArray<struct FOnlineFriendBPData> friendList);
	void OnFriendRejectedInvite(const struct FOnlineFriendBPData& FriendData);
	void OnFriendAcceptedInvite(const struct FOnlineFriendBPData& FriendData, int teamIndex);
	void OnEnteredBackfillingState();
	void OnCustomLobbyUpdated();
	void OnCustomLobbyInitialized();
	void OnCurrentGameModeSet(int numberOfTeams);
	void OnAcceptButtonPressed();
	void NotifyCountDownValue(bool bIsValid, int countdownTimer);
	bool JumpToMatch();
	bool IsTournamentMatch();
	bool IsReadyToJoinMatch();
	bool IsReadyForMatch();
	bool IsPrivateLobby();
	bool IsHostAPlayer();
	bool IsCustomMatchLobby();
	bool IsClientHost();
	bool IsCharacterInfoDisplayed();
	void InviteFriend(const struct FOnlineFriendBPData& FriendData, int teamIndex, int SlotIndex);
	void IgnoreInput(bool IgnoreInput);
	void HostStartMatch();
	void HostLeaveMatch();
	void HostJoinMatch(int teamIndex, int SlotIndex);
	bool HasBackendLobbyBeenCreated();
	int GetTimesLeftLobby();
	struct FGuid GetSelectedCharacters(bool bIncludeSelf, bool bOnlyReady, TArray<struct FGuid>* Allies, TArray<struct FGuid>* Enemies);
	TArray<struct FText> GetPointsTextArray();
	TArray<struct FText> GetPlayableLevelNames();
	TArray<struct FText> GetPlayableGameModeNames();
	int GetNumCharacterSelectedDuplicates(bool bIncludeEnemyTeam, bool bOnlyReady);
	int GetNextMatchMakingPenaltyTime();
	TArray<struct FText> GetMatchDurationTextArray();
	struct FString GetLobbyDisplayId();
	struct FPwndLoadout GetCurrentSelectedLoadout();
	void ClearLobbyPlayerDataForUpdate();
	void CharacterInfoScreenToggled();
	void CharacterInfoButtonPressed();
	void BootPlayer(const struct FOnlineFriendBPData& lobbyMember);
	bool AreThereAnEvenAmountOfPlayersOnClientsTeam();
};


// Class PWND.FrontEnd_LoginScreen
// 0x01C0 (0x0430 - 0x0270)
class UFrontEnd_LoginScreen : public UFrontEnd_BaseScreen
{
public:
	class UUI_TextureSwapButton*                       pSignInButton;                                            // 0x0270(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UUI_TextureSwapButton*                       pCreateAccountButton;                                     // 0x0278(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UEditableTextBox*                            pUserNameTextField;                                       // 0x0280(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UEditableTextBox*                            pPasswordTextField;                                       // 0x0288(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UCanvasPanel*                                pPanelParentForSubPages;                                  // 0x0290(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	struct FText                                       IncompleteLoginMessage;                                   // 0x0298(0x0018) (Edit)
	unsigned char                                      UnknownData00[0x180];                                     // 0x02B0(0x0180) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_LoginScreen");
		return ptr;
	}


	void OnSkipSignIn();
	void OnSignInButtonPressed();
	void OnCreateAccountPressed();
};


// Class PWND.FrontEnd_LootCrateScreen
// 0x0000 (0x0270 - 0x0270)
class UFrontEnd_LootCrateScreen : public UFrontEnd_BaseScreen
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_LootCrateScreen");
		return ptr;
	}


	void RequestToOpenCrate(int Index);
	void Public_OnLeftFaceButtonPressed();
	void Public_OnAcceptPressed();
	void OnReceiveLootCrateData(TArray<struct FGuidInventoryItem> lootCrates);
	void OnCrateSuccessfullyOpened(TArray<struct FGuidInventoryItem> itemsOpened, TArray<struct FGuidInventoryItem> itemsAwarded);
	void OnCrateFailedToOpen();
	bool IsItemEquipped(const struct FGuid& characterGuid, const struct FGuid& ItemGUID);
	void EquipItem(const struct FGuid& characterGuid, const struct FGuid& ItemGUID);
};


// Class PWND.FrontEnd_MainMenu
// 0x0050 (0x02C0 - 0x0270)
class UFrontEnd_MainMenu : public UFrontEnd_BaseScreen
{
public:
	class UTextBlock*                                  pMissionTitle;                                            // 0x0270(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	TArray<class UTextBlock*>                          pMissionNames;                                            // 0x0278(0x0010) (ExportObject, ZeroConstructor, Transient)
	TArray<class UTextBlock*>                          pMissionProgresses;                                       // 0x0288(0x0010) (ExportObject, ZeroConstructor, Transient)
	class UCanvasPanel*                                pMissionPanel;                                            // 0x0298(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UPwndGameUserSettings*                       Settings;                                                 // 0x02A0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UUI_GenericPopUp*                            penaltyPopup;                                             // 0x02A8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UUI_PenaltyWidget*                           penaltyWidget;                                            // 0x02B0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	float                                              m_fTimeSpentInMainMenu;                                   // 0x02B8(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x02BC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_MainMenu");
		return ptr;
	}


	void QuitGame();
	void QuickplayJoinGame();
	void OnUpdatedInventoryReceived();
	void OnReturnFromMatch();
	void OnPlayerMissionsRecieved(TArray<struct FMissionInfo> Missions);
	void OnEnterFromInitialLogin();
	bool HandleJoinPenalty();
	void GoToTrainingScreen();
	void GoToSocialScreen();
	void GoToOptionsScreen();
	void GoToLootCrateScreen();
	void GoToCustomizeScreen();
	void GoToCharactersScreen();
	int GetNumberOfOwnedLootCrates();
	void EnableTrainingButton(bool enable);
	void EnableSocialButton(bool enable);
	void EnablePlayButton(bool enable);
	void DisplayPenaltyPopup(int secondsLeft);
};


// Class PWND.FrontEnd_MatchTypeScreen
// 0x0000 (0x0270 - 0x0270)
class UFrontEnd_MatchTypeScreen : public UFrontEnd_BaseScreen
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_MatchTypeScreen");
		return ptr;
	}


	void SetLobbyVisibility(int visibilityOption);
	void SelectSpectateMatch(const struct FString& matchCode);
	void SelectRankedMatch();
	void SelectQuickMatch();
	void SelectJoinMatch(const struct FString& matchCode);
	void SelectCustomMatch();
	void SelectChallenges();
	void OnBack_Implementation();
};


// Class PWND.FrontEnd_OptionsScreen
// 0x06E0 (0x0950 - 0x0270)
class UFrontEnd_OptionsScreen : public UFrontEnd_BaseScreen
{
public:
	unsigned char                                      UnknownData00[0xA0];                                      // 0x0270(0x00A0) MISSED OFFSET
	TArray<struct FIntPoint>                           Resolutions;                                              // 0x0310(0x0010) (Edit, ZeroConstructor)
	TArray<int>                                        DisplayModes;                                             // 0x0320(0x0010) (Edit, ZeroConstructor)
	class UPwndGameUserSettings*                       Settings;                                                 // 0x0330(0x0008) (ZeroConstructor, IsPlainOldData)
	class UEngine*                                     GameEngine;                                               // 0x0338(0x0008) (ZeroConstructor, IsPlainOldData)
	class APwndBasePlayerController*                   OwningPC;                                                 // 0x0340(0x0008) (ZeroConstructor, IsPlainOldData)
	class UUI_SelectableGroup*                         pTopTabsSelectionGroup;                                   // 0x0348(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	struct FOptionsCache                               OriginalCache;                                            // 0x0350(0x0128) (Transient)
	struct FOptionsCache                               OnSaveCache;                                              // 0x0478(0x0128) (Transient)
	struct FString                                     ResolutionPropertyName;                                   // 0x05A0(0x0010) (Edit, ZeroConstructor)
	struct FString                                     ResolutionPropertyValue;                                  // 0x05B0(0x0010) (Edit, ZeroConstructor)
	struct FString                                     CharaterControlsPropertyValue;                            // 0x05C0(0x0010) (Edit, ZeroConstructor)
	struct FString                                     DisplayString;                                            // 0x05D0(0x0010) (Edit, ZeroConstructor)
	struct FString                                     ResolutionString;                                         // 0x05E0(0x0010) (Edit, ZeroConstructor)
	struct FString                                     GammaString;                                              // 0x05F0(0x0010) (Edit, ZeroConstructor)
	struct FString                                     ContrastString;                                           // 0x0600(0x0010) (Edit, ZeroConstructor)
	struct FString                                     GraphicsQualityString;                                    // 0x0610(0x0010) (Edit, ZeroConstructor)
	struct FString                                     VSyncString;                                              // 0x0620(0x0010) (Edit, ZeroConstructor)
	struct FString                                     BloomString;                                              // 0x0630(0x0010) (Edit, ZeroConstructor)
	struct FString                                     DepthOfFieldString;                                       // 0x0640(0x0010) (Edit, ZeroConstructor)
	struct FString                                     AmbientOcclusionString;                                   // 0x0650(0x0010) (Edit, ZeroConstructor)
	struct FString                                     PostProcessFXString;                                      // 0x0660(0x0010) (Edit, ZeroConstructor)
	struct FString                                     DynamicShadowsString;                                     // 0x0670(0x0010) (Edit, ZeroConstructor)
	struct FString                                     ViewDistanceString;                                       // 0x0680(0x0010) (Edit, ZeroConstructor)
	struct FString                                     AntiAliasingString;                                       // 0x0690(0x0010) (Edit, ZeroConstructor)
	struct FString                                     TextureQualityString;                                     // 0x06A0(0x0010) (Edit, ZeroConstructor)
	struct FString                                     VFXQualityString;                                         // 0x06B0(0x0010) (Edit, ZeroConstructor)
	struct FString                                     MotionBlurString;                                         // 0x06C0(0x0010) (Edit, ZeroConstructor)
	struct FString                                     LobbyCharacterQualityString;                              // 0x06D0(0x0010) (Edit, ZeroConstructor)
	struct FString                                     MasterVolumeString;                                       // 0x06E0(0x0010) (Edit, ZeroConstructor)
	struct FString                                     SFXVolumeString;                                          // 0x06F0(0x0010) (Edit, ZeroConstructor)
	struct FString                                     MusicVolumeString;                                        // 0x0700(0x0010) (Edit, ZeroConstructor)
	struct FString                                     InGameVoiceVolumeString;                                  // 0x0710(0x0010) (Edit, ZeroConstructor)
	struct FString                                     MouseSensitivityString;                                   // 0x0720(0x0010) (Edit, ZeroConstructor)
	struct FString                                     MouseInvertedString;                                      // 0x0730(0x0010) (Edit, ZeroConstructor)
	struct FString                                     ControllerHorizontalSensitivityString;                    // 0x0740(0x0010) (Edit, ZeroConstructor)
	struct FString                                     ControllerVerticalSensitivityString;                      // 0x0750(0x0010) (Edit, ZeroConstructor)
	struct FString                                     ControllerHorizontalInvertedString;                       // 0x0760(0x0010) (Edit, ZeroConstructor)
	struct FString                                     ControllerVerticalInvertedString;                         // 0x0770(0x0010) (Edit, ZeroConstructor)
	struct FString                                     VoiceActivationModeString;                                // 0x0780(0x0010) (Edit, ZeroConstructor)
	struct FString                                     VoiceActivationThresholdString;                           // 0x0790(0x0010) (Edit, ZeroConstructor)
	struct FString                                     AutoVoiceActivationString;                                // 0x07A0(0x0010) (Edit, ZeroConstructor)
	struct FString                                     ChatFilterEnabledString;                                  // 0x07B0(0x0010) (Edit, ZeroConstructor)
	struct FString                                     FOVString;                                                // 0x07C0(0x0010) (Edit, ZeroConstructor)
	struct FString                                     FrameRateString;                                          // 0x07D0(0x0010) (Edit, ZeroConstructor)
	struct FString                                     CharacterControlsString;                                  // 0x07E0(0x0010) (Edit, ZeroConstructor)
	TArray<struct FString>                             WindowedResolutionStrs;                                   // 0x07F0(0x0010) (ZeroConstructor)
	TArray<struct FString>                             FullScreenResolutionStrs;                                 // 0x0800(0x0010) (ZeroConstructor)
	TArray<struct FString>                             WindowedFullScreenResolutionStrs;                         // 0x0810(0x0010) (ZeroConstructor)
	class UScrollBox*                                  ScrollBoxVideo;                                           // 0x0820(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UScrollBox*                                  ScrollBoxControls;                                        // 0x0828(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UUI_PenaltyWidget*                           penaltyWidget;                                            // 0x0830(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0838(0x0008) MISSED OFFSET
	class UInputBindingUserWidget*                     widgetToConfirm;                                          // 0x0840(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	TMap<struct FString, int>                          ActionToWidgetsMap;                                       // 0x0848(0x0050) (ZeroConstructor, Transient)
	TArray<struct FArrayOfInputWidgets>                InputBindingWidgets;                                      // 0x0898(0x0010) (ZeroConstructor, Transient)
	bool                                               bGamepadDropDownActive;                                   // 0x08A8(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x08A9(0x0007) MISSED OFFSET
	class UUI_DropDownBase*                            GamepadDropDownButton;                                    // 0x08B0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UUI_GenericPopUp*                            RevertResolutionPopup;                                    // 0x08B8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	struct FText                                       AllCharactersString;                                      // 0x08C0(0x0018) (Edit)
	struct FText                                       ResolutionConfirmationTitle;                              // 0x08D8(0x0018) (Edit)
	struct FText                                       ResolutionConfirmationBody;                               // 0x08F0(0x0018) (Edit)
	struct FText                                       ResolutionConfirmationBodyEnd;                            // 0x0908(0x0018) (Edit)
	float                                              RevertResolutionTime;                                     // 0x0920(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x24];                                      // 0x0924(0x0024) MISSED OFFSET
	bool                                               bAllCharactersSelected;                                   // 0x0948(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0949(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_OptionsScreen");
		return ptr;
	}


	void WidgetOverrided(const struct FString& WidgetName);
	void UpdateVSync(int val);
	void UpdateVoiceActivationThreshold(int val);
	void UpdateVoiceActivationMode(int val);
	void UpdateViewDistance(int val);
	void UpdateTextureQuality(int val);
	void UpdateShadows(int val);
	void UpdateSFXVolume(int val);
	void UpdateResolution(int val);
	void UpdatePostProcessFX(int val);
	void UpdateMusicVolume(int val);
	void UpdateMouseSensitivity(int val);
	void UpdateMouseInverted(int val);
	void UpdateMotionBlur(int val);
	void UpdateMasterVolume(int val);
	void UpdateLobbyCharacterQuality(int val);
	void UpdateInGameVoiceVolume(int val);
	void UpdateGraphicsQuality(int val);
	void UpdateGamma(int val);
	void UpdateFrameRate(int val);
	void UpdateFOV(int val);
	void UpdateEffectsQuality(int val);
	void UpdateDisplayMode(int val);
	void UpdateDepthOfField(int val);
	void UpdateControllerVerticalSensitivity(int val);
	void UpdateControllerVerticalInverted(int val);
	void UpdateControllerHorizontalSensitivity(int val);
	void UpdateControllerHorizontalInverted(int val);
	void UpdateContrast(int val);
	void UpdateChatFilter(int val);
	void UpdateCharacterControls(int val);
	void UpdateBloom(int val);
	void UpdateAutoVoiceActivation(int val);
	void UpdateAntiAliasing(int val);
	void UpdateAmbientOcclusion(int val);
	void RevertResolution();
	void ResetDeleteOverridesButton();
	void PassTopTabsSelectionScreen(class UUI_SelectableGroup* pGroup);
	void OptionsWidgetUpdated(const struct FString& WidgetName, int Value);
	void OnSave_Implementation();
	void OnLeaveScreen();
	void OnDefault_Implementation();
	void OnBumperRight_Implementation();
	void OnBumperLeft_Implementation();
	void OnBack_Implementation();
	void InternalSettingsUpdated(const struct FString& WidgetName, int Value, bool bIsCutomValue);
	bool HasUnsavedChanges();
	void DeleteCharacterOverrides();
	void ConfirmResolution();
	void BeginExitFlow();
};


// Class PWND.FrontEnd_SearchingForMatchScreen
// 0x0008 (0x0278 - 0x0270)
class UFrontEnd_SearchingForMatchScreen : public UFrontEnd_BaseScreen
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0270(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_SearchingForMatchScreen");
		return ptr;
	}


	void OnMinimizeRequested();
	void MinimizeScreen();
	int GetEstimatedQueueTime();
	bool DoesTicketStillExist();
	bool CancelSearchingForMatch();
};


// Class PWND.FrontEnd_SocialScreen
// 0x0008 (0x0278 - 0x0270)
class UFrontEnd_SocialScreen : public UFrontEnd_BaseScreen
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0270(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_SocialScreen");
		return ptr;
	}


	void RemovePendingPartyInvite(const struct FOnlineFriendSocialBPData& FriendData);
	void OnWarningOfAboutToInviteTooManyPlayers();
	void OnReceivedPartyList(TArray<struct FOnlineFriendSocialBPData> friendList);
	void OnReceivedFriendsList(TArray<struct FOnlineFriendSocialBPData> friendList);
	void OnPartyMembersUpdated(TArray<struct FOnlineFriendSocialBPData> members, TArray<struct FOnlineFriendSocialBPData> invitedMembers);
	void OnInviteSuccessfullySent(const struct FOnlineFriendSocialBPData& FriendData);
	void OnInviteFailedToSend(const struct FOnlineFriendSocialBPData& FriendData);
	void OnFriendRejectedInvite(const struct FOnlineFriendSocialBPData& FriendData, bool Error);
	void OnFriendAcceptedInvite(const struct FOnlineFriendSocialBPData& FriendData);
	void KickFriendFromParty(const struct FOnlineFriendSocialBPData& FriendData);
	void InviteFriendToParty(const struct FOnlineFriendSocialBPData& FriendData);
};


// Class PWND.FrontEnd_TrainingScreen
// 0x0008 (0x0278 - 0x0270)
class UFrontEnd_TrainingScreen : public UFrontEnd_BaseScreen
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0270(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_TrainingScreen");
		return ptr;
	}


	void OnTransitionToTraining();
};


// Class PWND.UI_MenuNavigable
// 0x0050 (0x0280 - 0x0230)
class UUI_MenuNavigable : public UUserWidget
{
public:
	bool                                               bCauseSelectionOnGamePadAttention;                        // 0x0230(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0231(0x0007) MISSED OFFSET
	class UUI_MenuNavigable*                           pUpObject;                                                // 0x0238(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UUI_MenuNavigable*                           pDownObject;                                              // 0x0240(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UUI_MenuNavigable*                           pLeftObject;                                              // 0x0248(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UUI_MenuNavigable*                           pRightObject;                                             // 0x0250(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UUI_MenuNavigable*                           pLeftBumperObject;                                        // 0x0258(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UUI_MenuNavigable*                           pRightBumperObject;                                       // 0x0260(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x18];                                      // 0x0268(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.UI_MenuNavigable");
		return ptr;
	}


	void RegisterWidgetAnimation(class UWidgetAnimation* pWidgetAnimation);
	void OnRemoveSelection();
	void OnRemoveAttention(bool bWasMouse);
	void OnReceiveSelection();
	void OnReceiveAttention(bool bWasMouse);
	void OnClickedByMouse();
	void CreateUpConnection(class UUserWidget* pNavUp);
	void CreateTwoWayUpConnection(class UUserWidget* pNavUp);
	void CreateTwoWayRightConnection(class UUserWidget* pNavRight);
	void CreateTwoWayRightBumperConnection(class UUserWidget* pNavBumperRight);
	void CreateTwoWayLeftConnection(class UUserWidget* pNavLeft);
	void CreateTwoWayLeftBumperConnection(class UUserWidget* pNavBumperLeft);
	void CreateTwoWayDownConnection(class UUserWidget* pNavDown);
	void CreateRightConnection(class UUserWidget* pNavRight);
	void CreateLeftConnection(class UUserWidget* pNavLeft);
	void CreateDownConnection(class UUserWidget* pNavDown);
};


// Class PWND.FrontEnd_UIButton
// 0x0070 (0x02F0 - 0x0280)
class UFrontEnd_UIButton : public UUI_MenuNavigable
{
public:
	int                                                FontSize;                                                 // 0x0280(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0284(0x0004) MISSED OFFSET
	struct FText                                       MainText;                                                 // 0x0288(0x0018) (Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FScriptMulticastDelegate                    OnClicked;                                                // 0x02A0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UTextBlock*                                  pText;                                                    // 0x02B0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UButton*                                     pButton;                                                  // 0x02B8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UWidgetAnimation*                            pAnimUnselected;                                          // 0x02C0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UWidgetAnimation*                            pAnimUnselectedToHover;                                   // 0x02C8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UWidgetAnimation*                            pAnimHover;                                               // 0x02D0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UWidgetAnimation*                            pAnimHoverToUnselected;                                   // 0x02D8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UWidgetAnimation*                            pCurrentlyPlayingAnimation;                               // 0x02E0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x02E8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_UIButton");
		return ptr;
	}


	void RegisterUnSelectedAnimation(class UWidgetAnimation* pWidgetAnimation);
	void RegisterHoveredOverAnimation(class UWidgetAnimation* pWidgetAnimation);
	void RegisterAnimateToUnSelectedAnimation(class UWidgetAnimation* pWidgetAnimation);
	void RegisterAnimateToHoverAnimation(class UWidgetAnimation* pWidgetAnimation);
	void OnMouseUnHovered();
	void OnHoveredByMouse();
	void OnClickedButton();
};


// Class PWND.FrontEnd_UIButtonLoadoutItem
// 0x0038 (0x02B8 - 0x0280)
class UFrontEnd_UIButtonLoadoutItem : public UUI_MenuNavigable
{
public:
	struct FScriptMulticastDelegate                    OnClicked;                                                // 0x0280(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UImage*                                      pIcon;                                                    // 0x0290(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UTextBlock*                                  pTitleText;                                               // 0x0298(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UTextBlock*                                  pBodyText;                                                // 0x02A0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UWidgetAnimation*                            pDefaultAnim;                                             // 0x02A8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UWidgetAnimation*                            pHoverOverAnim;                                           // 0x02B0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEnd_UIButtonLoadoutItem");
		return ptr;
	}


	void OnMouseUnHovered();
	void OnHoveredByMouse();
	void OnClickedButton();
};


// Class PWND.FrontEndGameMode
// 0x0000 (0x0458 - 0x0458)
class AFrontEndGameMode : public AGameMode
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEndGameMode");
		return ptr;
	}

};


// Class PWND.FrontEndPawn
// 0x0000 (0x03E8 - 0x03E8)
class AFrontEndPawn : public APawn
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class PWND.FrontEndPawn");
		return ptr;
	}

};


// Class PWND.PwndBasePlayerController
// 0x0120 (0x0800 - 0x06E0)
class APwndBasePlayerController : public APlayerController
{
public:
	class USoundCue*                                   MenuMusicLoop;                                            // 0x06E0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class USoundCue*                                   MenuMusicEnd;                                             // 0x06E8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MenuMusicEndVolumeTransitionSpeed;                        // 0x06F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x06F4(0x0004) MISSED OFFSET
	class UClass*                                      PwndWidgetInterface;                                      // 0x06F8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UUserWidget*                                 pPwndWidgetInterfaceManager;                              // 0x0700(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	int8_t                                             InputIsResticted;                                         // 0x0708(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0709(0x0003) MISSED OFFSET
	float                                              MenuMusicEndVolume;                                       // 0x070C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              MenuMusicEndTimer;                                        // 0x0710(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0714(0x0004) MISSED OFFSET
	class UAudioComponent*                             MenuMusicLoopComp;                                        // 0x0718(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UAudioComponent*                             MenuMusicEndComp;                                         // 0x0720(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	bool                                               bLastInputWasGamepad;                                     // 0x0728(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0729(0x0003) MISSED OFFSET
	int                                                GamePadInputPressed;                                      // 0x072C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bGamePadInput;                                            // 0x0730(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0731(0x0003) MISSED OFFSET
	int                                                MouseInputPressed;                                        // 0x0734(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bMouseInput;                                              // 0x0738(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x0739(0x0003) MISSED OFFSET
	int                                                KeyboardInputPressed;                                     // 0x073C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	bool                                               bKeyboardInput;                                           // 0x0740(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
